Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("НастройкаДокумента") Тогда
		НастройкаДокументаДляЗаполнения = Параметры.Отбор.НастройкаДокумента;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("МобильноеУстройство") Тогда
		МобильноеУстройствоДляЗаполнения = Параметры.Отбор.МобильноеУстройство;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаДокументаДляЗаполнения) И Не ЗначениеЗаполнено(МобильноеУстройствоДляЗаполнения) Тогда
		Элементы.НастройкаДокумента.Видимость = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(НастройкаДокументаДляЗаполнения) И ЗначениеЗаполнено(МобильноеУстройствоДляЗаполнения) Тогда
		Элементы.МобильноеУстройство.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьЗначениями(Команда)
	
	ШаблонТекстаВопроса = "";
	
	Если ЗначениеЗаполнено(НастройкаДокументаДляЗаполнения) Тогда
		ШаблонТекстаВопроса = СтрШаблон(НСтр("ru = ' для настройки документа ""%1""'"), НастройкаДокументаДляЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МобильноеУстройствоДляЗаполнения) Тогда
		
		Если Не ПустаяСтрока(ШаблонТекстаВопроса) Тогда
			ШаблонТекстаВопроса = НСтр("ru = ' и'");
		КонецЕсли;
		
		ШаблонТекстаВопроса = ШаблонТекстаВопроса + СтрШаблон(НСтр("ru = ' для мобильного устройства ""%1""'"), МобильноеУстройствоДляЗаполнения);
		
	КонецЕсли;
	
	Если ПустаяСтрока(ШаблонТекстаВопроса) Тогда
		ШаблонТекстаВопроса = НСтр("ru = ' для всех настроек документов и всех мобильных устройств'");
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьЗначениямиПослеПодтверждения", ЭтотОбъект);
	
	ПоказатьВопрос(ОповещениеОЗавершении, СтрШаблон(НСтр("ru = 'Выполнить заполнение %1?'"), ШаблонТекстаВопроса), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьЗначениямиПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗначениямиНаСервере(НастройкаДокументаДляЗаполнения, МобильноеУстройствоДляЗаполнения);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначениямиНаСервере(НастройкаДокумента, МобильноеУстройство)
	
	НаборЗаписей = РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(НастройкаДокумента) Тогда
		НаборЗаписей.Отбор.НастройкаДокумента.Установить(НастройкаДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		НаборЗаписей.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
	КонецЕсли;
	
	НаборЗаписей.Заполнить(Новый Структура());
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
